pmorgantech/WaveX/firmware/esp32/sdkconfig.defaults
    # This file was generated using idf.py save-defconfig. It can be edited manually.
    # Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
    #
    # default:
CONFIG_IDF_TARGET="esp32p4"
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_DMA2D_OPERATION_FUNC_IN_IRAM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=5000
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_MAX_SOCKETS=4
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_MBEDTLS_TLS_DISABLED=y
CONFIG_VFS_MAX_COUNT=4
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3
CONFIG_BSP_LCD_TYPE_720_1280_5_INCH_A=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_LVGL_PORT_ENABLE_PPA=y

# LVGL's own PPA draw unit (CONFIG_LV_USE_PPA) was enabled in df672c5,
# measured, and turned back off in favour of software drawing. It made drawing
# genuinely faster - render median -25%, p95 37->29ms, max 95->47ms on the
# Diagnostics page - but cost ~14% more CPU and ~7% FPS overall, because
# ppa_evaluate() applies no minimum-area threshold and lv_draw_ppa_fill.c uses
# PPA_TRANS_MODE_BLOCKING: every tiny fill becomes a blocking hardware
# round-trip. That is not fixable without forking a managed component.
# Full numbers and method: docs/roadmap.md 0.3 item 1.
#
# LV_DRAW_BUF_ALIGN goes back to 4 with it; 128 was a hard requirement of
# LV_USE_PPA (lv_draw_ppa_private.h #errors otherwise), not a tuning choice.

# USB MIDI device class (roadmap Phase 1 item 8)
CONFIG_TINYUSB_MIDI_COUNT=1

# LVGL snapshot support (ui_screenshot.cpp, debug builds)
CONFIG_LV_USE_SNAPSHOT=y

# LVGL system monitor: FPS/CPU and LVGL-pool overlays, or in log mode the
# "sysmon: 30 FPS (refr_cnt ...) CPU 7%" line every ~300 ms on the console.
#
# OFF by default (2026-09-04). This is MEASUREMENT INSTRUMENTATION, not a
# shipping setting: the overlays draw on top of the product UI and log mode
# spams the console. It exists because nothing measured LVGL rendering at
# all, which is what left the roadmap's "LVGL 9.5 performance claim" open.
# To take measurements, enable the block below (here AND in the tracked
# sdkconfig - an existing sdkconfig wins over this file; `idf.py menuconfig`
# -> Component config -> LVGL -> Others -> System monitor does both), build,
# measure, then turn it back off before committing. Procedure, including the
# CONFIG_LV_USE_PPA A/B, is in docs/performance_monitoring.md Part 2.
#
# CONFIG_LV_USE_SYSMON=y
# CONFIG_LV_USE_PERF_MONITOR=y
# CONFIG_LV_PERF_MONITOR_ALIGN_TOP_LEFT=y       # overlay: clear of the softkey bar
# CONFIG_LV_USE_PERF_MONITOR_LOG_MODE=y         # console line instead of overlay
# CONFIG_LV_USE_MEM_MONITOR=y
# CONFIG_LV_MEM_MONITOR_ALIGN_TOP_RIGHT=y
# CONFIG_LV_USE_SYSMON is not set

# Picolibc instead of Newlib. Smaller image and, more usefully here, lower
# per-task stack and heap-allocation overhead on stdio paths - internal DMA
# heap is the scarce resource on this board (see display_manager's heap
# telemetry). Available from IDF v5.0 and the default from v6.0, so this also
# de-risks that upgrade. Safe for this project: nothing here touches
# "struct _reent" or redirects stdin/stdout/stderr per task, and no prebuilt
# library in the dependency tree targets RISC-V (the NemaGFX and zl38063
# archives are ARM/codec blobs that never link on ESP32-P4), so the
# LIBC_PICOLIBC_NEWLIB_COMPATIBILITY caveats do not apply. Revert with
# CONFIG_LIBC_NEWLIB=y if stdio behaviour ever looks wrong.
CONFIG_LIBC_PICOLIBC=y

# -----------------------------------------------------------------------------
# Watchdog and assertion posture - DELIBERATE, and a bench choice, not a
# shipping one. Recorded here because the 2026-08-29 review flagged all three
# and the reasoning was nowhere.
#
# CONFIG_ESP_INT_WDT_TIMEOUT_MS=5000 (default 300): hides interrupts-disabled
#   and long-critical-section bugs, which is the class the ESP32-P4 guide's
#   review checklist exists to catch. Raise the bar back before hardware
#   sign-off, and treat any stall it then reports as a real defect rather than
#   re-raising the timeout.
# CONFIG_ESP_TASK_WDT_INIT=n: a hung task freezes the instrument silently.
#   Several tasks poll on a delay, so a wedged one looks exactly like an idle
#   one. Worth enabling once the input paths are confirmed on the bench.
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y: removes configASSERT and
#   driver argument checks - the fastest way to turn a caught misuse into
#   undefined behaviour.
#
# Tracked as E-SDK1 in docs/code_review_esp32_20260829.md.
# -----------------------------------------------------------------------------

# -----------------------------------------------------------------------------
# Logging: keep DEBUG/VERBOSE call sites compiled in (MAXIMUM=VERBOSE) while
# the default output level stays INFO. This is what lets "WAVEX-LOG <tag>
# DEBUG" / esp_log_level_set enable a subsystem's detail at runtime with no
# rebuild - with MAXIMUM_EQUALS_DEFAULT those call sites don't exist in the
# binary and can never be turned on.
# -----------------------------------------------------------------------------
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=n
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
